app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM `projects`

  def show
    @project = Project.find(params[:id])
    @tasks = Task.search(params[:search], params[:page])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `tasks` WHERE (name like '%%') ORDER BY name LIMIT 0, 10
SELECT count(*) AS count_all FROM `tasks` WHERE (name like '%%')

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `user_id`, `description`) VALUES('', '2010-07-12 16:58:38', '2010-07-12 16:58:38', 2, '')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `updated_at` = '2010-07-12 17:16:52', `name` = 'Projeto de Graduação', `description` = 'Projeto para gerenciamento de redes da fapeg', `user_id` = 1 WHERE `id` = 1

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 4)
DELETE FROM `projects` WHERE `id` = 4