app/controllers/users_controller.rb

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `crypted_password`, `password_field`, `updated_at`, `persistence_token`, `login`, `password`, `email`) VALUES('Ju', '2010-07-14 15:18:43', 'a7944c46edb15a444ee1facd57fb23cf7d675bf3634e0bd5728d9866bbd8f5154829981e0af0c5b50e2f5534484d8a398363fcd185c3737844e424dd81196907', NULL, '2010-07-14 15:18:43', '70c0dd8520cc397a7e4d5ae9b150fbb4f114f3b5d755d49e635774b9c2c53ecf2914b7ef55893876dce23e11a2dd443f7ffd2634885017b423eaf99f92b1e24d', 'juhotmail', NULL, 'jujupiqueiroz@hotmail.com')

  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2010-07-13 14:52:18', `crypted_password` = '8fcef219b50a2fe3e5ca2d8bac3ce42476e65269d05a763b4675472a1f3fbdc01f67c86290c1c6b1449434594376187bbb9f4400c79ae7a5a43fec520e55d609', `persistence_token` = '2e8900d6a7a51dc07db895a5cfbd3e1258a7301797c2da441806dcadcee1e89452ae354af11dbc0b268e49330a942761869cf7f65af9f75424449817bfc3d6ab' WHERE `id` = 1

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 4)
DELETE FROM `users` WHERE `id` = 4